zupcorp23012025.Расширение1/src/Reports/СводнаяВедомостьПоАптекам/СводнаяВедомостьПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СводнаяВедомостьПоАптекам</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделения</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
</mdclass:Report>

zupcorp23012025.Расширение1/src/InformationRegisters/ДанныеПоАптекам/ДанныеПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоАптекам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПраздникиВремяДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПраздникиВремяНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОценку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусСроковые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусПоДМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаЛичнуюВыручку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаСовмещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВидыСтатусов</types>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаНеДТМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаДТМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уволенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОценкаТекст</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </resources>
  <resources>
    <name>Среднечасовое1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Среднечасовое2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажСрокиИЗМЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактПродажМУЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактПродажМУЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланМУСреднечасовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажТоваровНаПродвижении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияKPI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПринятыхЗвонков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗвонки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолСобранныхУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусСтрокиЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУслугВрача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаУслугиВрача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОчковыеЛинзы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОчковыеЛинзы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛичнаяВыручкаОптика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонусЗаОптику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеРаботы</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядКатегория</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядПодразделение</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/InformationRegisters/ПоказателиПоДолжностям/ПоказателиПоДолжностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиПоДолжностям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Минимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Максимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНочногоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПраздники</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПраздникиНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоплатаЗаКатегорию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияНочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов1До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов2До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонЧасов3До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДиапазонаЧасов3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПринятогоЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьСобраннойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудник</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияАптеки</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/Enums/ВидыСтатусов/ВидыСтатусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатусов</name>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

zupcorp23012025.Расширение1/src/Reports/СводнаяВедомостьПоАптекам/Forms/ФормаОтчета/Module.bsl
Функция ПолучитьВремяВсегоПоСотруднику(ФизическоеЛицо) 
	запрос=новый запрос;
	запрос.УстановитьПараметр("ФЛ",ФизическоеЛицо);
	запрос.УстановитьПараметр("ДатаС",Отчет.ДатаС);
	запрос.УстановитьПараметр("ДатаПо",Отчет.ДатаПо);
	запрос.Текст="ВЫБРАТЬ
	             |	СУММА(ДанныеПоАптекам.ВремяДень) КАК ВремяДень,
	             |	ДанныеПоАптекам.ФизическоеЛицо КАК ФизическоеЛицо
	             |ИЗ
	             |	РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
	             |ГДЕ
	             |	ДанныеПоАптекам.ФизическоеЛицо = &ФЛ
	             |	И ДанныеПоАптекам.ДатаС МЕЖДУ &ДатаС И &ДатаПо
	             |	И ДанныеПоАптекам.ДатаПо МЕЖДУ &ДатаС И &ДатаПо
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ДанныеПоАптекам.ФизическоеЛицо";
	Результат=запрос.Выполнить().Выгрузить();
	Для каждого Эл из Результат цикл
		ИтогоВремени=Эл.ВремяДень;
		конеццикла;
	Возврат ИтогоВремени;
	конецфункции
Функция ПолучитьНормативы()
	запрос=новый запрос;
	   запрос.УстановитьПараметр("ДатаС",Отчет.ДатаС);
	   запрос.Текст="ВЫБРАТЬ
	                |	ДПО_ПоказателиПоДолжностямСрезПоследних.НормаЧасов КАК НормаЧасов,
	                |	ДПО_ПоказателиПоДолжностямСрезПоследних.Минимум КАК Минимум,
	                |	ДПО_ПоказателиПоДолжностямСрезПоследних.Максимум КАК Максимум,
	                |	ДПО_ПоказателиПоДолжностямСрезПоследних.СтоимостьНочногоЧаса КАК СтоимостьНочногоЧаса
	                |ИЗ
	                |	РегистрСведений.ПоказателиПоДолжностям.СрезПоследних(&ДатаС) КАК ДПО_ПоказателиПоДолжностямСрезПоследних";
	   РезультатНормативы=запрос.Выполнить().Выгрузить();
	   
       Возврат РезультатНормативы;
   конецфункции

	&НаСервере
Функция СформироватьОтчет()
	Обработка =  РеквизитФормыВЗначение("Отчет");
	Макет = Обработка.ПолучитьМакет("Макет");
	
	ТабДок = Новый ТабличныйДокумент;
	 
	запрос=новый запрос;
	запрос.УстановитьПараметр("ДатаС",Отчет.ДатаС);
	запрос.УстановитьПараметр("ДатаПо",Отчет.ДатаПо);
	запрос.УстановитьПараметр("Подразделение",Отчет.Подразделения); 
	запрос.Текст="ВЫБРАТЬ
	             |	ДанныеПоАптекам.Сотрудник КАК Сотрудник,
	             |	ДанныеПоАптекам.Должность КАК Должность,
	             |	ДанныеПоАптекам.ВремяДень КАК ВремяДень,
	             |	ДанныеПоАптекам.ВремяНочь КАК ВремяНочь,
	             |	ДанныеПоАптекам.БонусЗаОценку КАК БонусЗаОценку,
	             |	ДанныеПоАптекам.БонусСроковые КАК БонусСроковые,
	             |	ДанныеПоАптекам.БонусМУ КАК БонусМУ,
	             |	ДанныеПоАптекам.БонусПоДМ КАК БонусПоДМ,
	             |	ДанныеПоАптекам.БонусЗаЛичнуюВыручку КАК БонусЗаЛичнуюВыручку,
	             |	ДанныеПоАптекам.БонусЗаСовмещение КАК БонусЗаСовмещение,
	             |	ДанныеПоАптекам.ПодразделениеРаботы КАК ПодразделениеРаботы,
	             |	ДанныеПоАптекам.Подразделение КАК Подразделение,
	             |	ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
	             |	ДанныеПоАптекам.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
	             |	ПОДСТРОКА(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, СТРНАЙТИ(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, ""№"") + 1, ДЛИНАСТРОКИ(ДанныеПоАптекам.ПодразделениеРаботы.Наименование)) КАК Сортировка,
	             |	0 КАК СортировкаЧисло
	             |ИЗ
	             |	РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
	             |ГДЕ
	             |	ДанныеПоАптекам.ДатаС МЕЖДУ &ДатаС И &ДатаПо
	             |	И ДанныеПоАптекам.ДатаПо МЕЖДУ &ДатаС И &ДатаПо";
				 //|	И ДанныеПоАптекам.Подразделение = &Подразделение
				 //|
				 //|УПОРЯДОЧИТЬ ПО
				 //|	ДанныеПоАптекам.ФизическоеЛицо.Наименование";
	             
	Если ЗначениеЗаполнено(Отчет.Подразделения) тогда
		
	 запрос.Текст=запрос.Текст+"
	 |	И ДанныеПоАптекам.ПодразделениеРаботы = &Подразделение";
 конецесли;
 
    запрос.Текст=запрос.Текст+"
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДанныеПоАптекам.ФизическоеЛицо.Наименование";
	 Результат=запрос.Выполнить().Выгрузить();
	 
	 запрос=новый запрос;
	 запрос.УстановитьПараметр("ДатаПо",Отчет.ДатаПо);
	 запрос.Текст="ВЫБРАТЬ
	              |	ДифференциацияБонусаПоСетиСрезПоследних.Подразделение КАК Подразделение,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.Бонус1 КАК Бонус1,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.Бонус2 КАК Бонус2,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов28Дней КАК НормаЧасов28Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов29Дней КАК НормаЧасов29Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов30Дней КАК НормаЧасов30Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов31День КАК НормаЧасов31День,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь28Дней КАК НормаНочь28Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь29Дней КАК НормаНочь29Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь30Дней КАК НормаНочь30Дней,
	              |	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь31Дней КАК НормаНочь31Дней
	              |ИЗ
	              |	РегистрСведений.ДифференциацияБонусаПоСети.СрезПоследних(&ДатаПо, ) КАК ДифференциацияБонусаПоСетиСрезПоследних";
	 РезультатПоказатели=запрос.Выполнить().Выгрузить();
	 
	Если ЗначениеЗаполнено(Отчет.Подразделения) тогда
		
	 запрос.Текст=запрос.Текст+" 
	              |ГДЕ
	              |	ДифференциацияБонусаПоСетиСрезПоследних.Подразделение = &Подразделение";
	 конецесли;
	 к=1;
	 
	РезПодр=Результат.Скопировать();
	РезПодр.Свернуть("Сортировка,СортировкаЧисло");
	Старт=1000;
	Для каждого Эл из РезПодр цикл
		Попытка
		Эл.СортировкаЧисло=Число(Эл.Сортировка);
	Исключение 
		Эл.СортировкаЧисло=Старт+1;
		КонецПопытки
		конеццикла;
РезПодр.Сортировать("СортировкаЧисло ВОЗР");	
	ВсегоИтогоДоГраниц1=0;
	 ИтогоВсегоПоРасчету1=0;
	 ИтогоОтработаноВсего1=0;
	  ИтогоСуммаВсего1=0;
    ИтогоЧасы1661=0;
	ИтогоЧасы1671=0;
	ИтогоЧасы2011=0;
	ИтогоЧасыНочь1=0;  
    ИтогоСумма1661=0;
	ИтогоСумма1671=0;
	ИтогоСумма2011=0;
	ИтогоСуммаНочь1=0;
	ИтогоБонусов121=0;
	ИтогоЛичнаяВыручка11=0;
	ИтогоБонус11=0;
	ИтогоЛичнаяВыручка21=0;
	ИтогоБонус21=0;
	ИтогоБонусМ1=0;
	ИтогоБонусЗМЗ1=0;
	ИтогоБонусОценка1=0;
	ИтогоДопВыплаты11=0;
	ИтогоДопВыплаты21=0; 
	ИтогоПремияМин1=0;
	ИтогоПремияМакс1=0;

	
	Для каждого Эл2 из РезПодр цикл
		ВсегоИтогоДоГраниц=0;
	 ИтогоВсегоПоРасчету=0;
	 ИтогоОтработаноВсего=0;
	  ИтогоСуммаВсего=0;
    ИтогоЧасы166=0;
	ИтогоЧасы167=0;
	ИтогоЧасы201=0;
	ИтогоЧасыНочь=0;  
    ИтогоСумма166=0;
	ИтогоСумма167=0;
	ИтогоСумма201=0;
	ИтогоСуммаНочь=0;
	ИтогоБонусов12=0;
	ИтогоЛичнаяВыручка1=0;
	ИтогоБонус1=0;
	ИтогоЛичнаяВыручка2=0;
	ИтогоБонус2=0;
	ИтогоБонусМ=0;
	ИтогоБонусЗМЗ=0;
	ИтогоБонусОценка=0;
	ИтогоДопВыплаты1=0;
	ИтогоДопВыплаты2=0; 
	ИтогоПремияМин=0;
	ИтогоПремияМакс=0;
	Обл3=Макет.ПолучитьОбласть("Заголовок");
	МасПодр=Результат.НайтиСтроки(Новый Структура("Сортировка",Эл2.Сортировка));
	Для каждого Эл3 из МасПодр цикл
	Обл3.Параметры.Подразделение=Эл3.Подразделение;
	Подразделение=Эл3.Подразделение;
	Прервать;
	конеццикла;
	ТабДок.Вывести(Обл3);
	Обл1=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл1);
	Обл2=Макет.ПолучитьОбласть("Данные");
	
	 Для каждого Эл из МасПодр цикл
		Обл2.Параметры.НомерПП=к;
		Обл2.Параметры.ФИО=Эл.Сотрудник;
		Обл2.Параметры.Должность=Эл.Должность; 
		Обл2.Параметры.ТН=Эл.Сотрудник.Код;
		Если Эл.Подразделение=Эл.ПодразделениеРаботы тогда
			Обл2.Параметры.ОснМесто="Да"
		иначе
			Обл2.Параметры.ОснМесто="Нет"

		конецесли; 
		
		ОбщееВремяВсего=ПолучитьВремяВсегоПоСотруднику(Эл.Сотрудник.ФизическоеЛицо);
		Процент=Окр((Эл.ВремяДень/ОбщееВремяВсего),2);
		Если ОбщееВремяВсего<=166 тогда
		Обл2.Параметры.Часы166=Процент*ОбщееВремяВсего;
		Обл2.Параметры.Часы167=0;
		Обл2.Параметры.Часы201=0;
	конецесли;
	    Если ОбщееВремяВсего>166 и ОбщееВремяВсего<=200 тогда
		Обл2.Параметры.Часы166=Процент*166;
		Обл2.Параметры.Часы167=Процент*(ОбщееВремяВсего-166);
		Обл2.Параметры.Часы201=0;
	конецесли; 
	Если ОбщееВремяВсего>=201  тогда
		Обл2.Параметры.Часы166=Процент*166;
		Обл2.Параметры.Часы167=Процент*34;
		Обл2.Параметры.Часы201=Процент*(ОбщееВремяВсего-200);
	конецесли;
       Обл2.Параметры.ЧасыНочь=Эл.ВремяНочь;
	   Обл2.Параметры.ОтработаноВсего=Обл2.Параметры.Часы166+Обл2.Параметры.Часы167+Обл2.Параметры.Часы201+Обл2.Параметры.ЧасыНочь;
	   Обл2.Параметры.Сумма166=100*Обл2.Параметры.Часы166;
	   Обл2.Параметры.Сумма167=125*Обл2.Параметры.Часы167; 
	   Обл2.Параметры.Сумма201=150*Обл2.Параметры.Часы201;
       Обл2.Параметры.СуммаНочь=200*Обл2.Параметры.ЧасыНочь; 
	   Обл2.Параметры.СуммаВсего=Обл2.Параметры.Сумма166+125*Обл2.Параметры.Часы167+150*Обл2.Параметры.Часы201+200*Обл2.Параметры.ЧасыНочь;
	   Обл2.Параметры.ЛичнаяВыручка1=Эл.ЛичнаяВыручкаНеДТМ;
	   ИтогоЛичнаяВыручка1=ИтогоЛичнаяВыручка1+Обл2.Параметры.ЛичнаяВыручка1;
	   Обл2.Параметры.ЛичнаяВыручка2=Эл.ЛичнаяВыручкаДТМ;
	   ИтогоЛичнаяВыручка2=ИтогоЛичнаяВыручка2+Обл2.Параметры.ЛичнаяВыручка2;
	   Обл2.Параметры.Бонус2=Эл.БонусПоДМ;
	   ИтогоБонус2=ИтогоБонус2+Обл2.Параметры.Бонус2;
	   Обл2.Параметры.Бонус1=Эл.БонусЗаЛичнуюВыручку;
	   ИтогоБонус1=ИтогоБонус1+ Обл2.Параметры.Бонус1;
	   Обл2.Параметры.ИтогоБонус12=Обл2.Параметры.Бонус1+Обл2.Параметры.Бонус2;
	   Обл2.Параметры.БонусМ=Эл.БонусМУ;
	   ИтогоБонусМ=ИтогоБонусМ+Обл2.Параметры.БонусМ;
	   Обл2.Параметры.БонусОценка=Эл.БонусЗаОценку; 
	    ИтогоБонусОценка=ИтогоБонусОценка+Обл2.Параметры.БонусОценка;

	  	    Обл2.Параметры.БонусЗМЗ=Эл.БонусСроковые;
		ИтогоБонусЗМЗ=ИтогоБонусЗМЗ+Обл2.Параметры.БонусЗМЗ;

	  Обл2.Параметры.ДопВыплаты1=Эл.БонусЗаСовмещение;
	  ИтогоДопВыплаты1=ИтогоДопВыплаты1+Обл2.Параметры.ДопВыплаты1;
	  //Обл2.Параметры.ИтогоБонус12=Обл2.Параметры.Бонус1+Обл2.Параметры.Бонус2;
	  Обл2.Параметры.ИтогоДоГраниц=Обл2.Параметры.СуммаВсего+ Обл2.Параметры.ИтогоБонус12+Обл2.Параметры.БонусМ+Обл2.Параметры.БонусОценка+Обл2.Параметры.БонусЗМЗ;
	  РезультатНормативы=ПолучитьНормативы();
	Для каждого Эл из РезультатНормативы цикл
		   НормаЧасов=Эл.НормаЧасов;
		   //KPIДень=Эл.KPIДень;
		   //KPIНочь=Эл.KPIНочь;
		   Минимум=Эл.Минимум;
		   Максимум=Эл.Максимум;
		   СтоимостьНочногоЧаса=Эл.СтоимостьНочногоЧаса;
	   конеццикла;
	Обл2.Параметры.МинимумПоФакту= Минимум*Обл2.Параметры.ОтработаноВсего/НормаЧасов;
	Обл2.Параметры.МаксимумПоФакту= Максимум*Обл2.Параметры.ОтработаноВсего/НормаЧасов; 
	Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.ИтогоДоГраниц;
    Обл2.Параметры.ПремияМин=0;
	Обл2.Параметры.ПремияМакс=0;
    Если  Обл2.Параметры.ИтогоДоГраниц<Обл2.Параметры.МинимумПоФакту тогда
	Обл2.Параметры.ПремияМин=Обл2.Параметры.МинимумПоФакту-Обл2.Параметры.ВсегоПоРасчету;

	Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.МинимумПоФакту;
	конецесли;


	Если  Обл2.Параметры.ИтогоДоГраниц>Обл2.Параметры.МаксимумПоФакту тогда
		Обл2.Параметры.ПремияМакс=Обл2.Параметры.МаксимумПоФакту-Обл2.Параметры.ВсегоПоРасчету;

	Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.МаксимумПоФакту;
конецесли;
    ИтогоПремияМин=ИтогоПремияМин+Обл2.Параметры.ПремияМин;
	ИтогоПремияМакс=ИтогоПремияМакс+Обл2.Параметры.ПремияМакс;
    ВсегоИтогоДоГраниц=ВсегоИтогоДоГраниц+Обл2.Параметры.ИтогоДоГраниц;
	ИтогоВсегоПоРасчету=ИтогоВсегоПоРасчету+Обл2.Параметры.ВсегоПоРасчету;
	ИтогоОтработаноВсего=ИтогоОтработаноВсего+Обл2.Параметры.ОтработаноВсего;
    ИтогоСуммаВсего=ИтогоСуммаВсего+Обл2.Параметры.СуммаВсего;
	ИтогоЧасы166=ИтогоЧасы166+Обл2.Параметры.Часы166;
	ИтогоЧасы167=ИтогоЧасы167+Обл2.Параметры.Часы167; 
	ИтогоЧасы201=ИтогоЧасы201+Обл2.Параметры.Часы201;
	ИтогоЧасыНочь=ИтогоЧасыНочь+Обл2.Параметры.ЧасыНочь;
	ИтогоСумма166=ИтогоСумма166+Обл2.Параметры.Сумма166;
	ИтогоСумма167=ИтогоСумма167+Обл2.Параметры.Сумма167; 
	ИтогоСумма201=ИтогоСумма201+Обл2.Параметры.Сумма201;
    ИтогоСуммаНочь=ИтогоСуммаНочь+Обл2.Параметры.СуммаНочь;
	ИтогоБонусов12=ИтогоБонусов12+Обл2.Параметры.ИтогоБонус12;
	

	ИтогоПремияМин1=ИтогоПремияМин1+Обл2.Параметры.ПремияМин;
	ИтогоПремияМакс1=ИтогоПремияМакс1+Обл2.Параметры.ПремияМакс;
    ВсегоИтогоДоГраниц1=ВсегоИтогоДоГраниц1+Обл2.Параметры.ИтогоДоГраниц;
	ИтогоВсегоПоРасчету1=ИтогоВсегоПоРасчету1+Обл2.Параметры.ВсегоПоРасчету;
	ИтогоОтработаноВсего1=ИтогоОтработаноВсего1+Обл2.Параметры.ОтработаноВсего;
    ИтогоСуммаВсего1=ИтогоСуммаВсего1+Обл2.Параметры.СуммаВсего;
	ИтогоЧасы1661=ИтогоЧасы1661+Обл2.Параметры.Часы166;
	ИтогоЧасы1671=ИтогоЧасы1671+Обл2.Параметры.Часы167; 
	ИтогоЧасы2011=ИтогоЧасы2011+Обл2.Параметры.Часы201;
	ИтогоЧасыНочь1=ИтогоЧасыНочь1+Обл2.Параметры.ЧасыНочь;
	ИтогоСумма1661=ИтогоСумма1661+Обл2.Параметры.Сумма166;
	ИтогоСумма1671=ИтогоСумма1671+Обл2.Параметры.Сумма167; 
	ИтогоСумма2011=ИтогоСумма2011+Обл2.Параметры.Сумма201;
    ИтогоСуммаНочь1=ИтогоСуммаНочь1+Обл2.Параметры.СуммаНочь;
	ИтогоБонусов121=ИтогоБонусов121+Обл2.Параметры.ИтогоБонус12;
	
	  к=к+1;
		ТабДок.Вывести(Обл2);
	конеццикла;
	Обл3=Макет.ПолучитьОбласть("Итоги");
	Обл3.Параметры.Аптека=Подразделение;
	Обл3.Параметры.ВсегоИтогоДоГраниц=ВсегоИтогоДоГраниц;
	Обл3.Параметры.ИтогоВсегоПоРасчету=ИтогоВсегоПоРасчету;
	Обл3.Параметры.ИтогоОтработаноВсего=ИтогоОтработаноВсего;
	Обл3.Параметры.ИтогоСуммаВсего=ИтогоСуммаВсего;
	Обл3.Параметры.ИтогоЧасы166=ИтогоЧасы166;
	Обл3.Параметры.ИтогоЧасы167=ИтогоЧасы167; 
	Обл3.Параметры.ИтогоЧасы201=ИтогоЧасы201;
	Обл3.Параметры.ИтогоЧасыНочь=ИтогоЧасыНочь;
	Обл3.Параметры.ИтогоСумма166=ИтогоСумма166;
	Обл3.Параметры.ИтогоСумма167=ИтогоСумма167; 
	Обл3.Параметры.ИтогоСумма201=ИтогоСумма201;
	Обл3.Параметры.ИтогоСуммаНочь=ИтогоСуммаНочь;
	Обл3.Параметры.ИтогоБонусов12=ИтогоБонусов12;
	Обл3.Параметры.ИтогоЛичнаяВыручка1=ИтогоЛичнаяВыручка1;
    Обл3.Параметры.ИтогоЛичнаяВыручка2=ИтогоЛичнаяВыручка2;
	Обл3.Параметры.ИтогоБонус1=ИтогоБонус1;
    Обл3.Параметры.ИтогоБонус2=ИтогоБонус2;
	Обл3.Параметры.ИтогоБонусМ=ИтогоБонусМ;
	Обл3.Параметры.ИтогоБонусЗМЗ=ИтогоБонусЗМЗ;
	Обл3.Параметры.ИтогоБонусОценка=ИтогоБонусОценка;
    Обл3.Параметры.ИтогоДопВыплаты1=ИтогоДопВыплаты1;
	Обл3.Параметры.ИтогоПремияМин=ИтогоПремияМин;
	Обл3.Параметры.ИтогоПремияМакс=ИтогоПремияМакс;
	
	ТабДок.Вывести(Обл3);
	
	ОблСправка=Макет.ПолучитьОбласть("Справка");
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сокращенное наименование");
    ДопРеквизит=Подразделение.ДополнительныеРеквизиты.Найти(ДопСвойство);
	ОблСправка.Параметры.КодПодр=Подразделение.Код;
	ОблСправка.Параметры.Подразделение=Подразделение;
	ОблСправка.Параметры.КодПодр=ДопРеквизит.Значение;
	
	Показатели=РезультатПоказатели.НайтиСтроки(Новый Структура("Подразделение",Подразделение));
	Для каждого Строка из Показатели цикл
	ЗаполнитьЗначенияСвойств(ОблСправка.Параметры,Строка);
	конеццикла;
	ТабДок.Вывести(ОблСправка);
	
	ОблИтоги1=Макет.ПолучитьОбласть("Итоги1"); 
	ОблИтоги1.Параметры.ВсегоИтогоДоГраниц=ВсегоИтогоДоГраниц;
	ОблИтоги1.Параметры.ИтогоВсегоПоРасчету=ИтогоВсегоПоРасчету;
	ОблИтоги1.Параметры.ИтогоОтработаноВсего=ИтогоОтработаноВсего;
	ОблИтоги1.Параметры.ИтогоСуммаВсего=ИтогоСуммаВсего;
	ОблИтоги1.Параметры.ИтогоЧасы166=ИтогоЧасы166;
	ОблИтоги1.Параметры.ИтогоЧасы167=ИтогоЧасы167; 
	ОблИтоги1.Параметры.ИтогоЧасы201=ИтогоЧасы201;
	ОблИтоги1.Параметры.ИтогоЧасыНочь=ИтогоЧасыНочь;
	Обл3.Параметры.ИтогоСумма166=ИтогоСумма166;
	Обл3.Параметры.ИтогоСумма167=ИтогоСумма167; 
	Обл3.Параметры.ИтогоСумма201=ИтогоСумма201;
	Обл3.Параметры.ИтогоСуммаНочь=ИтогоСуммаНочь;
	Обл3.Параметры.ИтогоБонусов12=ИтогоБонусов12;
	Обл3.Параметры.ИтогоЛичнаяВыручка1=ИтогоЛичнаяВыручка1;
    Обл3.Параметры.ИтогоЛичнаяВыручка2=ИтогоЛичнаяВыручка2;
	Обл3.Параметры.ИтогоБонус1=ИтогоБонус1;
    Обл3.Параметры.ИтогоБонус2=ИтогоБонус2;
	Обл3.Параметры.ИтогоБонусМ=ИтогоБонусМ;
	Обл3.Параметры.ИтогоБонусЗМЗ=ИтогоБонусЗМЗ;
	Обл3.Параметры.ИтогоБонусОценка=ИтогоБонусОценка;
    Обл3.Параметры.ИтогоДопВыплаты1=ИтогоДопВыплаты1;
	Обл3.Параметры.ИтогоПремияМин=ИтогоПремияМин;
	Обл3.Параметры.ИтогоПремияМакс=ИтогоПремияМакс;

	ТабДок.Вывести(ОблИтоги1);
конеццикла;
  

    Возврат ТабДок;
	конецфункции
&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок=СформироватьОтчетНаСервере();
	ТабДок.Показать();
КонецПроцедуры
&НаСервере
Функция СформироватьОтчетНаСервере()
	Обработка =  РеквизитФормыВЗначение("Отчет");
	Макет = Обработка.ПолучитьМакет("Макет");

	ТабДок = Новый ТабличныйДокумент;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПо",Отчет.ДатаПо);
	Запрос.Текст="ВЫБРАТЬ
	|	ДифференциацияБонусаПоСетиСрезПоследних.Подразделение КАК Подразделение,
	|	ДифференциацияБонусаПоСетиСрезПоследних.Бонус1 КАК Бонус1,
	|	ДифференциацияБонусаПоСетиСрезПоследних.Бонус2 КАК Бонус2,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов28Дней КАК НормаЧасов28Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов29Дней КАК НормаЧасов29Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов30Дней КАК НормаЧасов30Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаЧасов31День КАК НормаЧасов31День,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь28Дней КАК НормаНочь28Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь29Дней КАК НормаНочь29Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь30Дней КАК НормаНочь30Дней,
	|	ДифференциацияБонусаПоСетиСрезПоследних.НормаНочь31Дней КАК НормаНочь31Дней
	|ИЗ
	|	РегистрСведений.ДифференциацияБонусаПоСети.СрезПоследних(&ДатаПо, ) КАК ДифференциацияБонусаПоСетиСрезПоследних";
	РезультатПоказатели=Запрос.Выполнить().Выгрузить();
	
	//Если ЗначениеЗаполнено(Отчет.Подразделения) тогда
	//	
	//	Запрос.Текст=запрос.Текст+" 
	//	|ГДЕ
	//	|	ДифференциацияБонусаПоСетиСрезПоследних.Подразделение = &Подразделение";
	//КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПоАптекам.ПодразделениеРаботы КАК ПодразделениеРаботы,
		|	ВЫБОР
		|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(ПОДСТРОКА(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, СТРНАЙТИ(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, ""№"") + 1, 5))) = 1
		|			ТОГДА ""0"" + СОКРЛП(ПОДСТРОКА(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, СТРНАЙТИ(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, ""№"") + 1, 5))
		|		ИНАЧЕ СОКРЛП(ПОДСТРОКА(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, СТРНАЙТИ(ДанныеПоАптекам.ПодразделениеРаботы.Наименование, ""№"") + 1, 5))
		|	КОНЕЦ КАК НомерАптеки
		|ПОМЕСТИТЬ ВТ_Аптеки
		|ИЗ
		|	РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
		|ГДЕ
		|	ДанныеПоАптекам.ДатаС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДанныеПоАптекам.ДатаПо МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Аптеки.НомерАптеки КАК НомерАптеки,
		|	ДанныеПоАптекам.ПодразделениеРаботы КАК ПодразделениеРаботы,
		|	ДанныеПоАптекам.Сотрудник КАК Сотрудник,
		|	ДанныеПоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеПоАптекам.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ДанныеПоАптекам.Должность КАК Должность,
		|	ДанныеПоАптекам.РазрядКатегория КАК РазрядКатегория,
		|	ДанныеПоАптекам.Подразделение КАК Подразделение,
		|	ДанныеПоАптекам.ВремяДень КАК ВремяДень,
		|	ДанныеПоАптекам.ВремяНочь КАК ВремяНочь,
		|	ДанныеПоАптекам.ПраздникиВремяДень КАК ПраздникиВремяДень,
		|	ДанныеПоАптекам.ПраздникиВремяНочь КАК ПраздникиВремяНочь,
		|	ДанныеПоАптекам.ЛичнаяВыручкаНеДТМ КАК ЛичнаяВыручкаНеДТМ,
		|	ДанныеПоАптекам.БонусЗаЛичнуюВыручку КАК БонусЗаЛичнуюВыручку,
		|	ДанныеПоАптекам.ЛичнаяВыручкаДТМ КАК ЛичнаяВыручкаДТМ,
		|	ДанныеПоАптекам.БонусПоДМ КАК БонусПоДМ,
		|	ДанныеПоАптекам.БонусМУ КАК БонусМУ,
		|	ДанныеПоАптекам.БонусСроковые КАК БонусСроковые,
		|	ДанныеПоАптекам.БонусЗаОценку КАК БонусЗаОценку,
		|	ДанныеПоАптекам.БонусЗаСовмещение КАК БонусЗаСовмещение
		|ИЗ
		|	РегистрСведений.ДанныеПоАптекам КАК ДанныеПоАптекам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Аптеки КАК ВТ_Аптеки
		|		ПО ДанныеПоАптекам.ПодразделениеРаботы = ВТ_Аптеки.ПодразделениеРаботы
		|ГДЕ
		|	ДанныеПоАптекам.ДатаС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДанныеПоАптекам.ДатаПо МЕЖДУ &НачалоПериода И &КонецПериода
	    |	И ДанныеПоАптекам.Статус = &Завершено
		|   И НЕ ДанныеПоАптекам.Должность=&Должность
		|	И ДанныеПоАптекам.ПодразделениеРаботы В ИЕРАРХИИ(&ПодразделениеРаботы)";
	Если ЗначениеЗаполнено(Отчет.Подразделения) тогда
	 	Запрос.Текст=Запрос.Текст+"
	 	|	И ДанныеПоАптекам.ПодразделениеРаботы = &Подразделение";
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерАптеки,
		|	СотрудникНаименование
		|ИТОГИ ПО
		|	ПодразделениеРаботы";
	
	Запрос.УстановитьПараметр("НачалоПериода", Отчет.ДатаС);
	Запрос.УстановитьПараметр("КонецПериода", Отчет.ДатаПо);
	Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделения);
	запрос.УстановитьПараметр("Завершено",Перечисления.ВидыСтатусов.Завершено);
	Запрос.УстановитьПараметр("ПодразделениеРаботы",справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Аптечный отдел",истина));
	Запрос.УстановитьПараметр("Должность",справочники.Должности.НайтиПоНаименованию("Врач-офтальмолог",истина));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАптеки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Общие итоги по аптекам
			ВсегоПоРасчету1=0;
			ИтогоДоГраниц1=0;
			ОтработаноВсего1=0;
			ИтогоЗаОтработанноеВремя1=0;
			Часы11=0;
			Сумма11=0;
			Часы21=0;
			Сумма21=0;
			Часы31=0;
			Сумма31=0;           
			ЧасыНочь1=0;
			СуммаНочь1=0;
			ЧасыДеньПраздники1=0;
			СуммаПраздникиДень1=0;
			ЧасыНочьПраздники1=0;
			СуммаПраздникиНочь1=0;
			ИтогоБунусы1=0;
			ВыручкаНеДТМ1=0;
			БонусНеДТМ1=0;
			ВыручкаДТМ1=0;
			БонусДТМ1=0;
			БонусМаркет1=0;
			БонусЗМЗ1=0;
			ОценкаРук1=0;
			Доплата11=0;
			ПремияМин1=0;
			ПремияМакс1=0;
	
	Пока ВыборкаАптеки.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		//Сообщить(ВыборкаАптеки.ПодразделениеРаботы);
		Обл3=Макет.ПолучитьОбласть("Заголовок");
		Обл3.Параметры.Подразделение=ВыборкаАптеки.ПодразделениеРаботы;
		ТабДок.Вывести(Обл3);
		Обл1=Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(Обл1);
		Обл2=Макет.ПолучитьОбласть("Данные");
		ПорядковыйНомер=0;
		
		//Для итоги по аптеке
			ВсегоПоРасчету=0;
			МинФакт=0;
			МаксФакт=0;
			ИтогоДоГраниц=0;
			ОтработаноВсего=0;
			ИтогоЗаОтработанноеВремя=0;
			Часы1=0;
			Сумма1=0;
			Часы2=0;
			Сумма2=0;
			Часы3=0;
			Сумма3=0;           
			ЧасыНочь=0;
			СуммаНочь=0;
			ЧасыДеньПраздники=0;
			СуммаПраздникиДень=0;
			ЧасыНочьПраздники=0;
			СуммаПраздникиНочь=0;
			ИтогоБунусы=0;
			ВыручкаНеДТМ=0;
			БонусНеДТМ=0;
			ВыручкаДТМ=0;
			БонусДТМ=0;
			БонусМаркет=0;
			БонусЗМЗ=0;
			ОценкаРук=0;
			Доплата1=0;
			ПремияМин=0;
			ПремияМакс=0;
			//ОсновноеМестоРаботы="Да";
			//ТабельныйНомер="";
		
		Сотр=ВыборкаАптеки.Выбрать();
		Пока Сотр.Следующий() Цикл
			//Сообщить(Сотр.Сотрудник);
			Запрос2=Новый Запрос;
			Запрос2.Текст="ВЫБРАТЬ
			              |	НачисленияЗППоАптекам.ФизическоеЛицо КАК ФизическоеЛицо,
			              |	НачисленияЗППоАптекам.ВсегоПоРасчету КАК ВсегоПоРасчету,
			              |	НачисленияЗППоАптекам.ОтработаноВсего КАК ОтработаноВсего,
			              |	НачисленияЗППоАптекам.ИтогоЗаОтработанноеВремя КАК ИтогоЗаОтработанноеВремя,
			              |	НачисленияЗППоАптекам.Оклад0_166_Часы КАК Оклад0_166_Часы,
			              |	НачисленияЗППоАптекам.Оклад0_166Сумма КАК Оклад0_166Сумма,
			              |	НачисленияЗППоАптекам.Оклад2Часы КАК Оклад2Часы,
			              |	НачисленияЗППоАптекам.Оклад2Сумма КАК Оклад2Сумма,
			              |	НачисленияЗППоАптекам.Оклад3_Часы КАК Оклад3_Часы,
			              |	НачисленияЗППоАптекам.Оклад3_Сумма КАК Оклад3_Сумма,
			              |	НачисленияЗППоАптекам.Ночь_Часы КАК Ночь_Часы,
			              |	НачисленияЗППоАптекам.Ночь_Сумма КАК Ночь_Сумма,
			              |	НачисленияЗППоАптекам.ПраздникиДеньЧасы КАК ПраздникиДеньЧасы,
			              |	НачисленияЗППоАптекам.ПраздникиДеньСумма КАК ПраздникиДеньСумма,
			              |	НачисленияЗППоАптекам.ПраздникиНочьЧасы КАК ПраздникиНочьЧасы,
			              |	НачисленияЗППоАптекам.ПраздникиНочьСумма КАК ПраздникиНочьСумма,
			              |	НачисленияЗППоАптекам.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
			              |	НачисленияЗППоАптекам.БонусАкции КАК БонусАкции,
			              |	НачисленияЗППоАптекам.БонусЗМЗ КАК БонусЗМЗ,
			              |	НачисленияЗППоАптекам.БонусОценка КАК БонусОценка
			              |ИЗ
			              |	РегистрСведений.НачисленияЗППоАптекам КАК НачисленияЗППоАптекам
			              |ГДЕ
			              |	НачисленияЗППоАптекам.ФизическоеЛицо = &ФизическоеЛицо
			              |	И НачисленияЗППоАптекам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
			Запрос2.УстановитьПараметр("ФизическоеЛицо",Сотр.ФизическоеЛицо);
			Запрос2.УстановитьПараметр("ДатаНачала",Отчет.ДатаС);
			Запрос2.УстановитьПараметр("ДатаОкончания",Отчет.ДатаПо);
			Рез1=Запрос2.Выполнить(); 
			Если НЕ Рез1.Пустой() Тогда
				Начисления=Рез1.Выгрузить();
			Иначе
				Продолжить;
			КонецЕсли;
			
			Запрос3=Новый Запрос;
			Запрос3.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
			              |	ПоказателиПоДолжностямСрезПоследних.Минимум КАК Минимум,
			              |	ПоказателиПоДолжностямСрезПоследних.Максимум КАК Максимум,
			              |	ПоказателиПоДолжностямСрезПоследних.НормаЧасов КАК НормаЧасов,
			              |	ПоказателиПоДолжностямСрезПоследних.СтоимостьНочногоЧаса КАК СтоимостьНочногоЧаса,
			              |	ПоказателиПоДолжностямСрезПоследних.Коэффициент КАК Коэффициент,
			              |	ПоказателиПоДолжностямСрезПоследних.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию
			              |ИЗ
			              |	РегистрСведений.ПоказателиПоДолжностям.СрезПоследних(
			              |			&Дата,
			              |			Должность = &Должность
			              |				И КатегорияСотрудник = &КатегорияСотрудник) КАК ПоказателиПоДолжностямСрезПоследних";
			Запрос3.УстановитьПараметр("Дата",Отчет.ДатаС);
			Запрос3.УстановитьПараметр("Должность",Сотр.Должность);
			Запрос3.УстановитьПараметр("КатегорияСотрудник",Сотр.РазрядКатегория);
			Рез3=Запрос3.Выполнить();
			Минимум=33000;
			Максимума=50000;
			НормаЧасов=166;
			Коэффициент=1;
			СтоимостьНочногоЧаса=0;
			ДоплатаЗаКатегорию=0;
			Если НЕ Рез3.Пустой() Тогда
				Показатели=Рез3.Выбрать();
				Пока Показатели.Следующий() Цикл
					Минимум=Показатели.Минимум;
					Максимум=Показатели.Максимум;
					НормаЧасов=Показатели.НормаЧасов;
					Коэффициент=Показатели.Коэффициент;
					СтоимостьНочногоЧаса=Показатели.СтоимостьНочногоЧаса;
					ДоплатаЗаКатегорию=Показатели.ДоплатаЗаКатегорию;
					Если НормаЧасов=0 Тогда
						НормаЧасов=166;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ПорядковыйНомер=ПорядковыйНомер+1;
						
			Обл2.Параметры.НомерПП=ПорядковыйНомер;
			Обл2.Параметры.ФИО=Сотр.Сотрудник;
			Обл2.Параметры.Должность=Сотр.Должность; 
			Обл2.Параметры.ТН=Сотр.Сотрудник.Код;
			Если Сотр.Подразделение=Сотр.ПодразделениеРаботы Тогда
				Обл2.Параметры.ОснМесто="Да"
			Иначе
				Обл2.Параметры.ОснМесто="Нет"
        	КонецЕсли; 
			  //ОтработаноВсего=Сотр.ВремяДень+Сотр.ВремяНочь;
			НачисленияОтработаноДень=Начисления[0].Оклад0_166_Часы+Начисления[0].Оклад2Часы+Начисления[0].Оклад3_Часы;
			k=0;
			Если НачисленияОтработаноДень>0 Тогда
				k=Сотр.ВремяДень/НачисленияОтработаноДень;
			КонецЕсли;
			
			Обл2.Параметры.Часы166=ОКР(Начисления[0].Оклад0_166_Часы*k,2);
			Обл2.Параметры.Часы167=ОКР(Начисления[0].Оклад2Часы*k,2);
			Обл2.Параметры.Часы201=ОКР(Начисления[0].Оклад3_Часы*k,2);
			
			Обл2.Параметры.ЧасыНочь=Сотр.ВремяНочь;
	   		Обл2.Параметры.ОтработаноВсего=Сотр.ВремяДень+Сотр.ВремяНочь;;
			
			Обл2.Параметры.Сумма166=ОКР(Начисления[0].Оклад0_166Сумма*k,2);
	   		Обл2.Параметры.Сумма167=ОКР(Начисления[0].Оклад2Сумма*k,2); 
	   		Обл2.Параметры.Сумма201=ОКР(Начисления[0].Оклад3_Сумма*k,2);
       		Обл2.Параметры.СуммаНочь=ОКР(СтоимостьНочногоЧаса*Сотр.ВремяНочь*Коэффициент,2);
			Обл2.Параметры.СуммаВсего=Обл2.Параметры.Сумма166+Обл2.Параметры.Сумма167+Обл2.Параметры.Сумма201+Обл2.Параметры.СуммаНочь;
			
			Обл2.Параметры.ЛичнаяВыручка1=Сотр.ЛичнаяВыручкаНеДТМ;
			Обл2.Параметры.Бонус1=ОКР(Сотр.БонусЗаЛичнуюВыручку*Коэффициент,2);
			Обл2.Параметры.ЛичнаяВыручка2=Сотр.ЛичнаяВыручкаДТМ;
			Обл2.Параметры.Бонус2=ОКР(Сотр.БонусПоДМ*Коэффициент,2);
			Обл2.Параметры.ИтогоБонус12=Обл2.Параметры.Бонус1+Обл2.Параметры.Бонус2;
			
			Обл2.Параметры.БонусМ=ОКР(Сотр.БонусМУ*Коэффициент,2);
			Обл2.Параметры.БонусЗМЗ=ОКР(Сотр.БонусСроковые*Коэффициент,2);
			Обл2.Параметры.БонусОценка=ОКР(Сотр.БонусЗаОценку*Коэффициент,2);
			//Учитываем пределы премий
			Если Обл2.Параметры.БонусМ>Начисления[0].БонусАкции Тогда
				Обл2.Параметры.БонусМ=Начисления[0].БонусАкции;
			КонецЕсли;
			Если Обл2.Параметры.БонусЗМЗ>Начисления[0].БонусЗМЗ Тогда
				Обл2.Параметры.БонусЗМЗ=Начисления[0].БонусЗМЗ;
			КонецЕсли;
			Если Обл2.Параметры.БонусОценка>Начисления[0].БонусОценка Тогда
				Обл2.Параметры.БонусОценка=Начисления[0].БонусОценка;
			КонецЕсли; 
						
			
			
			Обл2.Параметры.ДопВыплаты1=ОКР(Сотр.БонусЗаСовмещение*Коэффициент,2);
			k1=0;
			Если Начисления[0].ОтработаноВсего>0 Тогда
				 k1=Обл2.Параметры.ОтработаноВсего/Начисления[0].ОтработаноВсего;
			КонецЕсли;
			
			ДоплатаЗаКатегорию1=ОКР(Начисления[0].ДоплатаЗаКатегорию*k1,2);
			//Учитываем праздники у продавец-консультант
			ПраздникиДеньСумма=0;
			ПраздникиНочьСумма=0;
			Если Сотр.Должность=Справочники.Должности.НайтиПоНаименованию("Продавец-консультант",Истина) Тогда
				k3=0;
				Если Начисления[0].ПраздникиДеньЧасы>0 Тогда
					 k3=Сотр.ПраздникиВремяДень/Начисления[0].ПраздникиДеньЧасы;
				КонецЕсли;
				ПраздникиДеньСумма=ОКР(Начисления[0].ПраздникиДеньСумма*k3,2);
				k3=0;
				Если Начисления[0].ПраздникиНочьЧасы>0 Тогда
					 k3=Сотр.ПраздникиВремяНочь/Начисления[0].ПраздникиНочьЧасы;
				КонецЕсли;
				ПраздникиНочьСумма=ОКР(Начисления[0].ПраздникиНочьСумма*k3,2);  
			КонецЕсли;

						
			Обл2.Параметры.МинимумПоФакту= ОКР(Минимум*Обл2.Параметры.ОтработаноВсего/НормаЧасов,2);
			Обл2.Параметры.МаксимумПоФакту= ОКР(Максимум*Обл2.Параметры.ОтработаноВсего/НормаЧасов,2);
			Обл2.Параметры.ИтогоДоГраниц=Обл2.Параметры.СуммаВсего+ Обл2.Параметры.ИтогоБонус12+Обл2.Параметры.БонусМ+Обл2.Параметры.БонусОценка
										+Обл2.Параметры.БонусЗМЗ+ДоплатаЗаКатегорию1+ПраздникиДеньСумма+ПраздникиНочьСумма;
			
			Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.ИтогоДоГраниц;
    		Обл2.Параметры.ПремияМин=0;
			Обл2.Параметры.ПремияМакс=0;
    		Если  Обл2.Параметры.ИтогоДоГраниц<Обл2.Параметры.МинимумПоФакту тогда
				Обл2.Параметры.ПремияМин=Обл2.Параметры.МинимумПоФакту-Обл2.Параметры.ВсегоПоРасчету;
      			Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.МинимумПоФакту;
			КонецЕсли;
            Если  Обл2.Параметры.ИтогоДоГраниц>Обл2.Параметры.МаксимумПоФакту тогда
				Обл2.Параметры.ПремияМакс=Обл2.Параметры.МаксимумПоФакту-Обл2.Параметры.ВсегоПоРасчету;
				Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.МаксимумПоФакту;
			КонецЕсли;
			Обл2.Параметры.ВсегоПоРасчету=Обл2.Параметры.ВсегоПоРасчету+Обл2.Параметры.ДопВыплаты1;
			
			//Заменяем ВсегоПоРасчету пропорционально начислениям 
			Обл2.Параметры.ВсегоПоРасчету=ОКР(Начисления[0].ВсегоПоРасчету*k1,2);
			
			ТабДок.Вывести(Обл2);
			
			//Суммируем итоги
			ВсегоПоРасчету=ВсегоПоРасчету+Обл2.Параметры.ВсегоПоРасчету;
			ИтогоДоГраниц=ИтогоДоГраниц+Обл2.Параметры.ИтогоДоГраниц;
			ОтработаноВсего=ОтработаноВсего+Обл2.Параметры.ОтработаноВсего;
			ИтогоЗаОтработанноеВремя=ИтогоЗаОтработанноеВремя+Обл2.Параметры.СуммаВсего;
			Часы1=Часы1+Обл2.Параметры.Часы166;
			Сумма1=Сумма1+Обл2.Параметры.Сумма166;
			Часы2=Часы2+Обл2.Параметры.Часы167;
			Сумма2=Сумма2+Обл2.Параметры.Сумма167;
			Часы3=Часы3+Обл2.Параметры.Часы201;
			Сумма3=Сумма3+Обл2.Параметры.Сумма201;           
			ЧасыНочь=ЧасыНочь+Обл2.Параметры.ЧасыНочь;
			СуммаНочь=СуммаНочь+Обл2.Параметры.СуммаНочь;
			ЧасыДеньПраздники=ЧасыДеньПраздники+Сотр.ПраздникиВремяДень;
			СуммаПраздникиДень=СуммаПраздникиДень+ПраздникиДеньСумма;
			ЧасыНочьПраздники=ЧасыНочьПраздники+Сотр.ПраздникиВремяНочь;
			СуммаПраздникиНочь=СуммаПраздникиНочь+ПраздникиНочьСумма;
			ИтогоБунусы=ИтогоБунусы+Обл2.Параметры.ИтогоБонус12;
			ВыручкаНеДТМ=ВыручкаНеДТМ+Обл2.Параметры.ЛичнаяВыручка1;
			БонусНеДТМ=БонусНеДТМ+Обл2.Параметры.Бонус1;
			ВыручкаДТМ=ВыручкаДТМ+Обл2.Параметры.ЛичнаяВыручка2;
			БонусДТМ=БонусДТМ+Обл2.Параметры.Бонус2;
			БонусМаркет=БонусМаркет+Обл2.Параметры.БонусМ;
			БонусЗМЗ=БонусЗМЗ+Обл2.Параметры.БонусЗМЗ;
			ОценкаРук=ОценкаРук+Обл2.Параметры.БонусОценка;
			Доплата1=Доплата1+Обл2.Параметры.ДопВыплаты1;
			ПремияМин=ПремияМин+Обл2.Параметры.ПремияМин;
			ПремияМакс=ПремияМакс+Обл2.Параметры.ПремияМакс;
			
		КонецЦикла;
		Обл3=Макет.ПолучитьОбласть("Итоги");
		Обл3.Параметры.Аптека=ВыборкаАптеки.ПодразделениеРаботы;
		Обл3.Параметры.ВсегоИтогоДоГраниц=ИтогоДоГраниц;
		Обл3.Параметры.ИтогоВсегоПоРасчету=ВсегоПоРасчету;
		Обл3.Параметры.ИтогоОтработаноВсего=ОтработаноВсего;
		Обл3.Параметры.ИтогоСуммаВсего=ИтогоЗаОтработанноеВремя;
		Обл3.Параметры.ИтогоЧасы166=Часы1;
		Обл3.Параметры.ИтогоЧасы167=Часы2; 
		Обл3.Параметры.ИтогоЧасы201=Часы3;
		Обл3.Параметры.ИтогоЧасыНочь=ЧасыНочь;
		Обл3.Параметры.ИтогоСумма166=Сумма1;
		Обл3.Параметры.ИтогоСумма167=Сумма2; 
		Обл3.Параметры.ИтогоСумма201=Сумма3;
		Обл3.Параметры.ИтогоСуммаНочь=СуммаНочь;
		Обл3.Параметры.ИтогоБонусов12=ИтогоБунусы;
		Обл3.Параметры.ИтогоЛичнаяВыручка1=ВыручкаНеДТМ;
		Обл3.Параметры.ИтогоЛичнаяВыручка2=ВыручкаДТМ;
		Обл3.Параметры.ИтогоБонус1=БонусНеДТМ;
		Обл3.Параметры.ИтогоБонус2=БонусДТМ;
		Обл3.Параметры.ИтогоБонусМ=БонусМаркет;
		Обл3.Параметры.ИтогоБонусЗМЗ=БонусЗМЗ;
		Обл3.Параметры.ИтогоБонусОценка=ОценкаРук;
		Обл3.Параметры.ИтогоДопВыплаты1=Доплата1;
		Обл3.Параметры.ИтогоПремияМин=ПремияМин;
		Обл3.Параметры.ИтогоПремияМакс=ПремияМакс;
		
		ТабДок.Вывести(Обл3);
		
		//Справка
		ОблСправка=Макет.ПолучитьОбласть("Справка");
		ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сокращенное наименование");
		ДопРеквизит=ВыборкаАптеки.ПодразделениеРаботы.ДополнительныеРеквизиты.Найти(ДопСвойство);
		ОблСправка.Параметры.КодПодр=ВыборкаАптеки.ПодразделениеРаботы.Код;
		ОблСправка.Параметры.Подразделение=ВыборкаАптеки.ПодразделениеРаботы;
		//ОблСправка.Параметры.КодПодр=ДопРеквизит.Значение;
		
		Показатели=РезультатПоказатели.НайтиСтроки(Новый Структура("Подразделение",ВыборкаАптеки.ПодразделениеРаботы));
		Для каждого Строка из Показатели цикл
			ЗаполнитьЗначенияСвойств(ОблСправка.Параметры,Строка);
		конеццикла;
		ТабДок.Вывести(ОблСправка);
		
		//Общие итоги по аптекам
		ВсегоПоРасчету1=ВсегоПоРасчету1+ВсегоПоРасчету;
		ИтогоДоГраниц1=ИтогоДоГраниц1+ИтогоДоГраниц;
		ОтработаноВсего1=ОтработаноВсего1+ОтработаноВсего;
		ИтогоЗаОтработанноеВремя1=ИтогоЗаОтработанноеВремя1+ИтогоЗаОтработанноеВремя;
		Часы11=Часы11+Часы1;
		Сумма11=Сумма11+Сумма1;
		Часы21=Часы21+Часы2;
		Сумма21=Сумма21+Сумма2;
		Часы31=Часы31+Часы3;
		Сумма31=Сумма31+Сумма3;           
		ЧасыНочь1=ЧасыНочь1+ЧасыНочь;
		СуммаНочь1=СуммаНочь1+СуммаНочь;
		ЧасыДеньПраздники1=ЧасыДеньПраздники1+ЧасыДеньПраздники;
		СуммаПраздникиДень1=СуммаПраздникиДень1+СуммаПраздникиДень;
		ЧасыНочьПраздники1=ЧасыНочьПраздники1+ЧасыНочьПраздники;
		СуммаПраздникиНочь1=СуммаПраздникиНочь1+СуммаПраздникиНочь;
		ИтогоБунусы1=ИтогоБунусы1+ИтогоБунусы;
		ВыручкаНеДТМ1=ВыручкаНеДТМ1+ВыручкаНеДТМ;
		БонусНеДТМ1=БонусНеДТМ1+БонусНеДТМ;
		ВыручкаДТМ1=ВыручкаДТМ1+ВыручкаДТМ;
		БонусДТМ1=БонусДТМ1+БонусДТМ;
		БонусМаркет1=БонусМаркет1+БонусМаркет;
		БонусЗМЗ1=БонусЗМЗ1+БонусЗМЗ;
		ОценкаРук1=ОценкаРук1+ОценкаРук;
		Доплата11=Доплата11+Доплата1;
		ПремияМин1=ПремияМин1+ПремияМин;
		ПремияМакс1=ПремияМакс1+ПремияМакс;
		
	КонецЦикла;
	//Всего по всем аптекам
	Обл3=Макет.ПолучитьОбласть("Итоги1");
	Обл3.Параметры.ВсегоИтогоДоГраниц=ИтогоДоГраниц1;
	Обл3.Параметры.ИтогоВсегоПоРасчету=ВсегоПоРасчету1;
	Обл3.Параметры.ИтогоОтработаноВсего=ОтработаноВсего1;
	Обл3.Параметры.ИтогоСуммаВсего=ИтогоЗаОтработанноеВремя1;
	Обл3.Параметры.ИтогоЧасы166=Часы11;
	Обл3.Параметры.ИтогоЧасы167=Часы21; 
	Обл3.Параметры.ИтогоЧасы201=Часы31;
	Обл3.Параметры.ИтогоЧасыНочь=ЧасыНочь1;
	Обл3.Параметры.ИтогоСумма166=Сумма11;
	Обл3.Параметры.ИтогоСумма167=Сумма21; 
	Обл3.Параметры.ИтогоСумма201=Сумма31;
	Обл3.Параметры.ИтогоСуммаНочь=СуммаНочь1;
	Обл3.Параметры.ИтогоБонусов12=ИтогоБунусы1;
	Обл3.Параметры.ИтогоЛичнаяВыручка1=ВыручкаНеДТМ1;
	Обл3.Параметры.ИтогоЛичнаяВыручка2=ВыручкаДТМ1;
	Обл3.Параметры.ИтогоБонус1=БонусНеДТМ1;
	Обл3.Параметры.ИтогоБонус2=БонусДТМ1;
	Обл3.Параметры.ИтогоБонусМ=БонусМаркет1;
	Обл3.Параметры.ИтогоБонусЗМЗ=БонусЗМЗ1;
	Обл3.Параметры.ИтогоБонусОценка=ОценкаРук1;
	Обл3.Параметры.ИтогоДопВыплаты1=Доплата11;
	Обл3.Параметры.ИтогоПремияМин=ПремияМин1;
	Обл3.Параметры.ИтогоПремияМакс=ПремияМакс1;
	
	ТабДок.Вывести(Обл3);
	Возврат ТабДок;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции
